{
  "studymode": {
  	"position": "Web Developer",
  	"companyUrl": "http://www.studymode.com",
  	"classes": "",
    "title": "Studymode",
    "timeline": "Jan&nbsp;-&nbsp;Aug<br>2014",
    "logo": "images/studymode-icon.svg",
    "projects": {
      "WYSIWYG": "Enhanced CKEditor WYSIWYG (What You See Is What You Get) editor and created server security filters. Programmed featured product for flashcard site monetization.",
      "HTML5 Viewer": "Researched and implemented pdf2htmlEX with soffice to convert uploaded essay documents into HTML5 and enhance front-end user experience.",
      "Language Detection": "Researched and integrated Google's Compact Language Detector 2 (CLD) library with flashcard site to support Text-To-Speech feature integration.",
      "Solve.com": "Built user interface to solve mathematical equations and provide step by step analysis of the solution. Strategized in a team-environment for new beta product."
    }
  },
  "mexipass": {
  	"position": "Web Developer / IT Administrator",
  	"companyUrl": "http://www.mexipass.com",
  	"classes": "",
    "title": "Mexipass",
    "timeline": "2011&nbsp;-&nbsp;2014",
    "logo": "images/mexipass-icon.svg",
    "projects": {
      "Web Portals": "Developed a custom Joomla content management system (CMS) site to act as the Client and Marketing Staff interface to the company partnered Policy Enterprise software.",
      "ProtegeMex Prototype v2": "Implemented a second prototype website ported from v1 adding new features to streamline content updates by Sales Team. Added i18n internationalization, and implemented custom CMS.",
      "ProtegeMex Prototype v1": "Prototyped an Insurance Policy Management web app adding a new line of business. A system that allows Customers and Agents to fully manage their insurance policies.",
      "Amazon Cloud Migration": "Led migration of legacy servers to Amazon Cloud services reducing server costs by about 40%.",
      "SysAdmin": "Was promoted within 2 months to manage local Windows Hyper-V 2008 servers."
    }
  },
  "mailielem": {
  	"position": "Web Developer",
  	"companyUrl": "http://www.hawaiipublicschools.org/ParentsAndStudents/EnrollingInSchool/SchoolFinder/Pages/Maili-Elementary.aspx",
  	"classes": "",
    "title": "Maili Elementary School",
    "timeline": "2010&nbsp;-&nbsp;2011",
    "logo": "images/hidoe-icon.svg",
    "projects": {
      "Inventory Management": "Created a web app to manage general, electronics, and keys inventories streamlining staff operations.",
      "Absence Calendar": "Reduced filing errors by creating a web app to track paper form submissions of teacher absences.",
      "Assessment": "Provided Admin Staff a streamlined process to collect assessment data on teachers through a custom web app."
    }
  },
  "superb": {
  	"position": "Web Developer",
  	"companyUrl": "http://www.superb.net",
  	"classes": "",
    "title": "Superb Internet",
    "timeline": "2009&nbsp;-&nbsp;2010",
    "logo": "images/superb-icon.svg",
    "projects": {
      "Superb Registrar": "Increased user retention rates by re-writing workflow logic of existing Domain Registrar web app."
    }
  },
  "education": {
		"end": 2009,
    "position": "",
		"title": "<span class=\"icon-graduation-cap-icon\"></span>&nbsp;Bachelor in Computer Science - University of Hawai`i, Manoa"
	}
}